In [4]:
import numpy as np
import pandas as pd
import seaborn as sns

## listeleme ile oluşturma

In [5]:
datam = [1,2,3,4,5,6,7,8]

In [9]:
pd.DataFrame(datam, columns=["sayılar"])

   sayılar
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8

## Np.array ile DF oluşturma

In [8]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [12]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [13]:
df.head(3)

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [14]:
df.tail(3)

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
df.sample(2)

   var1  var2  var3
0     1     2     3
2     7     8     9

In [19]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [22]:
df.columns = ['sütun1', 'sütun2', 'sütun3']   # column'ları değiştirdik
df

   sütun1  sütun2  sütun3
0       1       2       3
1       4       5       6
2       7       8       9

In [23]:
df.shape

(3, 3)

In [24]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

## Dict ile DF oluşturma

In [25]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [26]:
s3

array([4, 4, 8, 0, 5])

In [27]:
mydict = {"var1" : s1, "var2" : s2, "var3" : s3}

In [28]:
df1 = pd.DataFrame(mydict)

In [29]:
df1.head()

   var1  var2  var3
0     6     2     4
1     6     1     4
2     3     2     8
3     4     8     0
4     0     2     5

In [31]:
df1[1:3]

   var1  var2  var3
1     6     1     4
2     3     2     8

In [32]:
df1.shape

(5, 3)

In [33]:
df1.index = ["a", "b", "c", "d", "e"]

In [34]:
df1

   var1  var2  var3
a     6     2     4
b     6     1     4
c     3     2     8
d     4     8     0
e     0     2     5

In [35]:
df1["a":"d"]

   var1  var2  var3
a     6     2     4
b     6     1     4
c     3     2     8
d     4     8     0

In [36]:
"A B C D E".split()

['A', 'B', 'C', 'D', 'E']

In [37]:
np.random.seed(101)  # seed ile herkes çalıştırdığında eşit sayılar olmasını sağlıyoruz
df3 = pd.DataFrame(np.random.randn(5,4), index="A B C D E".split(), columns = "W X Y Z".split())

df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [42]:
type(df3["W"])  # tek parantez ile series döndürür

pandas.core.series.Series

In [43]:
df3[["W"]]  # çift parantez ile dataframe döndürür

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [44]:
type(df3[["W"]])

pandas.core.frame.DataFrame

In [45]:
df3[["W", "Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [52]:
df3["yeni_sütun"] = df3["W"] + df3["Z"]
df3

          W         X         Y         Z  yeni_sütun
A  2.706850  0.628133  0.907969  0.503826    3.210676
B  0.651118 -0.319318 -0.848077  0.605965    1.257083
C -2.018168  0.740122  0.528813 -0.589001   -2.607169
D  0.188695 -0.758872 -0.933237  0.955057    1.143752
E  0.190794  1.978757  2.605967  0.683509    0.874303

In [53]:
df3["yepyeni"]  = df3["X"] * df3["Y"]
df3

          W         X         Y         Z  yeni_sütun   yepyeni
A  2.706850  0.628133  0.907969  0.503826    3.210676  0.570325
B  0.651118 -0.319318 -0.848077  0.605965    1.257083  0.270806
C -2.018168  0.740122  0.528813 -0.589001   -2.607169  0.391387
D  0.188695 -0.758872 -0.933237  0.955057    1.143752  0.708208
E  0.190794  1.978757  2.605967  0.683509    0.874303  5.156577

## Dropping

In [48]:
df3.drop(["yeni_sütun", "yepyeni"], axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df3

          W         X         Y         Z  yeni_sütun   yepyeni
A  2.706850  0.628133  0.907969  0.503826    3.210676  0.570325
B  0.651118 -0.319318 -0.848077  0.605965    1.257083  0.270806
C -2.018168  0.740122  0.528813 -0.589001   -2.607169  0.391387
D  0.188695 -0.758872 -0.933237  0.955057    1.143752  0.708208
E  0.190794  1.978757  2.605967  0.683509    0.874303  5.156577

In [54]:
df3.drop(["yeni_sütun", "yepyeni"], axis = 1, inplace=True)  # kalıcı sil

df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df3.drop("C", axis = 0, inplace=True)  # satır sildik

In [57]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## .loc vs .iloc

In [58]:
m = np.random.randint(1,30, size = (10, 3))
df4 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df4

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

In [59]:
df4.loc[1]

var1    25
var2     8
var3     7
Name: 1, dtype: int32

In [60]:
df4.loc[1:4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13

In [61]:
df4.iloc[1:4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8

In [62]:
"a b c d e f g h i j".split()

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [63]:
df4.index = "a b c d e f g h i j".split()
df4

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11
g    13    18    25
h    12    20    16
i     2    25     5
j    29    20    19

In [64]:
df4["a" : "f"]

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11

In [65]:
df4["a" : "f"]["var2"]

a    11
b     8
c    10
d    24
e    16
f    21
Name: var2, dtype: int32

In [66]:
df4["a" : "f"][["var2"]]  # çift parantez ile dataframeye dönüştürdük

   var2
a    11
b     8
c    10
d    24
e    16
f    21

In [67]:
df4.iloc[1:5]["var2"]

b     8
c    10
d    24
e    16
Name: var2, dtype: int32

In [68]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df3.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [72]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       4 non-null      float64
 1   X       4 non-null      float64
 2   Y       4 non-null      float64
 3   Z       4 non-null      float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [75]:
df3.iloc[:, [2]]

          Y
A  0.907969
B -0.848077
D -0.933237
E  2.605967

In [76]:
df3.iloc[:, 2:]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [77]:
df3["Y"]

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [79]:
df3.Y  # bu şekilde de çağırabiliriz

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [80]:
df3.iloc[[0,0], [3,1]]

          Z         X
A  0.503826  0.628133
A  0.503826  0.628133

In [81]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df3 > 0

      W      X      Y     Z
A  True   True   True  True
B  True  False  False  True
D  True  False  False  True
E  True   True   True  True

In [83]:
df3[df3 > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
df3[df3["X"] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df3[df3["W"] > 0]["Y"]

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [86]:
df3[df3["W"] > 0][["Y", "Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [87]:
df3[(df3["W"] > 0) & (df3["Y"] > 0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [88]:
df3[(df3["W"] > 0) | (df3["Y"] > 0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Reset Index

In [91]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [90]:
df3.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [93]:
df3.reset_index(drop=True)  # eski indexleri attık

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2  0.188695 -0.758872 -0.933237  0.955057
3  0.190794  1.978757  2.605967  0.683509

In [94]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
new_index = "CA NY WY OR".split()
new_index

['CA', 'NY', 'WY', 'OR']

In [103]:
df3["States"] = new_index

df3

               W         X         Y         Z States
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
WY      0.188695 -0.758872 -0.933237  0.955057     WY
OR      0.190794  1.978757  2.605967  0.683509     OR

In [104]:
df3.set_index("States", inplace=True)

In [105]:
df3

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509

In [106]:
outside = ["M1", "M1", "M1", "M2", "M2", "M2"]
inside = [1,2,3,1,2,3]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1), ('M1', 2), ('M1', 3), ('M2', 1), ('M2', 2), ('M2', 3)]

In [108]:
hier_index = pd.MultiIndex.from_tuples(multi_index)
type(hier_index)

pandas.core.indexes.multi.MultiIndex

In [109]:
df5 = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns = ["A", "B"])
df5

             A         B
M1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
M2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [110]:
df5.loc["M1"]

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [112]:
df5.loc["M1"].loc[[1]]

          A        B
1 -0.497104 -0.75407

In [116]:
df5.xs("M1")  # loc işlemini yaptı

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [118]:
df5.xs(("M1", 1))  # M1'in alt katmanındaki 1nci index'teki satırı döndürdü

A   -0.497104
B   -0.754070
Name: (M1, 1), dtype: float64

## Seaborn Overview

In [119]:
df = sns.load_dataset("planets")

df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [120]:
df.shape

(1035, 6)

In [122]:
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [123]:
df.sample(3)

               method  number  orbital_period    mass  distance  year
1030          Transit       1        3.941507     NaN    172.00  2006
325   Radial Velocity       2      226.930000  0.1872     32.58  2008
420   Radial Velocity       1     1531.000000  6.9200     37.44  2002

In [124]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [126]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [127]:
df.iloc[1:4, 2:4]

   orbital_period   mass
1         874.774   2.21
2         763.000   2.60
3         326.030  19.40

In [128]:
df.drop("number", axis=1)

               method  orbital_period   mass  distance  year
0     Radial Velocity      269.300000   7.10     77.40  2006
1     Radial Velocity      874.774000   2.21     56.95  2008
2     Radial Velocity      763.000000   2.60     19.84  2011
3     Radial Velocity      326.030000  19.40    110.62  2007
4     Radial Velocity      516.220000  10.50    119.47  2009
...               ...             ...    ...       ...   ...
1030          Transit        3.941507    NaN    172.00  2006
1031          Transit        2.615864    NaN    148.00  2007
1032          Transit        3.191524    NaN    174.00  2007
1033          Transit        4.125083    NaN    293.00  2008
1034          Transit        4.187757    NaN    260.00  2008

[1035 rows x 5 columns]

In [130]:
df[(df["mass"] > 3) & (df["distance"] >180)]

              method  number  orbital_period  mass  distance  year
161  Radial Velocity       2           428.5  15.2    214.00  2009
181  Radial Velocity       2          1022.0   3.4    354.00  2011
245  Radial Velocity       1           471.6  14.0    300.30  2005
396  Radial Velocity       1           647.3   4.0    221.24  2011
563  Radial Velocity       1          4885.0   3.1    189.39  2009
587  Radial Velocity       1           875.5   9.9    352.11  2012
610  Radial Velocity       1           672.1  11.1    289.02  2012
620  Radial Velocity       1           745.7   5.3    307.69  2011

In [131]:
df[(df["mass"] > 3) | (df["distance"] >180)]

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
5     Radial Velocity       1      185.840000   4.80     76.39  2008
6     Radial Velocity       1     1773.400000   4.64     18.15  2002
...               ...     ...             ...    ...       ...   ...
1024          Transit       1        3.662387    NaN    240.00  2012
1026          Transit       1        0.925542    NaN    470.00  2014
1028          Transit       1        3.352057    NaN   3200.00  2012
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[322 rows x 6 columns]